app/controllers/products_controller.rb

    def index
      @products = Product.all.page(params[:page])
---
SELECT "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

    def create
      @product = Product.new(product_params)
      authorize @product
      if @product.save
---
INSERT INTO "products" ("name", "size", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "sfsdf"], ["size", "xcv"], ["price", 3424], ["created_at", "2023-06-25 23:20:00.719759"], ["updated_at", "2023-06-25 23:20:00.719759"]]

    def update
      # authorize @product

      if @product.update(product_params)
---
UPDATE "products" SET "size" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["size", "xl"], ["price", 200], ["updated_at", "2023-06-24 17:15:53.472680"], ["id", 3]]