app/controllers/reviews_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_name", "rating", "comments", "created_at", "updated_at", "product_id") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", ""], ["rating", 2.5], ["comments", ""], ["created_at", "2023-06-25 23:04:27.114211"], ["updated_at", "2023-06-25 23:04:27.114211"], ["product_id", 1]]
---
         def create

             @product = Product.find(params[:product_id])

            # @reviews = @user.reviews.create(review_params)

            #@user = User.find_by(id: current_user )

           # @user = User.find(user_id)



             @review = @product.reviews.create(review_params)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
         def set_product

           @product = Product.find(params[:product_id])